# ESTADÍSTICA DESCRIPTIVA

In [2]:
import numpy as np
import pandas as pd
import seaborn as sb # Paquete que nos da la opción de acceder a algunos data frame (DF)

In [3]:
# Vamos a cargar los datos
titanic = sb.load_dataset("titanic") # Cargamos los datos en DF "titanic"

In [4]:
titanic.head() # head() nos deja ver las 5 primeras erntradas

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

####  Lo primero hay que hacer es una limpieza de datos.
#### Vamos a categorizar la columna "survided".

In [7]:
titanic["survided"] = pd.Categorical(titanic["survived"]) # pasamos la columna numérica a cualitativa, 
# como si cambiaramos un int a str. Porque hemos cambiado un dato cuantitativo a uno categorico=cualitativo.

In [8]:
titanic["pclass"] = pd.Categorical(titanic["pclass"]) # Categorizamos la columna "pclass"

# Tablas de Contigencia
tablas que creamos para hacer nuestros cálculos más allá del data frame original

#### Tabla de contigencia absoluta:

In [15]:
# Vamos a crear una tabla de fecuencias absolutas
# Cramos un data frame con .crosstab()
tab = pd.crosstab(index = titanic["survived"], columns = "pasajeros")
tab

col_0     pasajeros
survived
0               549
1               342

# Se ha creado un DataFrame

In [14]:
type(tab)

pandas.core.frame.DataFrame

#### Tabla de contingecia. Tabla de frecuencia relativas.

In [18]:
# Creamos una tabla de frecuencias relativas. Divide el elemento entre la suma de la columna.
trel = tab/tab.sum()
trel

col_0     pasajeros
survived
0          0.616162
1          0.383838

# Egercicio 1

Haced una tabla de frecuancias absolutas y otra de frecuencuas relativas ver cuántos pasajeros viajaban en 1º clase,
cuantas en 2ª y cuantas en 3ª, y las proporciones.

In [21]:
# Creamos una tabla de contingencia de frecuancia absoluta
tab1 = pd.crosstab(index = titanic["pclass"], columns = "pclass")
tab1

col_0   pclass
pclass
1          216
2          184
3          491

In [24]:
# Creamos una tabla de contingencia de frecuencia relativa
trel1 = tab1/tab1.sum()
trel1

col_0     pclass
pclass
1       0.242424
2       0.206510
3       0.551066

In [25]:
# Tablas de dos variables. Podemosrelacionar variables.

In [26]:
survived_sex = pd.crosstab(index = titanic["survived"], columns = titanic["sex"])
survived_sex

sex       female  male
survived
0             81   468
1            233   109

In [34]:
# Vamos a cambiar los nombres de las columnas y las filas de la tabla anterior
# para hacerla más legible.
survived_sex.index = ["murieron", "sobrevivieron"] # Le cambiamos los nombres de las filas
survived_sex.columns = ["mujeres", "hombres"] # Cambiamos nombres de las columnas
survived_sex

               mujeres  hombres
murieron            81      468
sobrevivieron      233      109

# Ejercicio 2

Hacer una tabla para ver en nº de personas que sobrevivió en función de la clase en la que viajaban, ¿influyó?

In [55]:
survived_pclass = pd.crosstab(index = titanic["survived"], columns = titanic["pclass"])
survived_pclass

pclass      1   2    3
survived
0          80  97  372
1         136  87  119

In [56]:
survived_pclass.index = ["murieron", "sobrevivieron"]
survived_pclass.columns = ["Primera", "Segunda", "Tercera"]
survived_pclass

               Primera  Segunda  Tercera
murieron            80       97      372
sobrevivieron      136       87      119

In [57]:
# Añadiendo // margins = True // nos da la opción de crear una nuava columna y filas (suma las filas y las columnas)
survived_pclass = pd.crosstab(index = titanic["survived"], columns = titanic["pclass"], margins = True)
survived_pclass.index = ["murieron", "sobrevivieron", "total_clase"]
survived_pclass.columns = ["primera", "segunda", "tercera", "total_sobrevivieron"]
survived_pclass

               primera  segunda  tercera  total_sobrevivieron
murieron            80       97      372                  549
sobrevivieron      136       87      119                  342
total_clase        216      184      491                  891

# Frecuancias relativas globales 
Globales respectos al total de pasajeros // (proporciones o porcentajes)

In [60]:
# Se calcula el porcentaje respecto al total de pasajeros
survived_pclass/survived_pclass.loc["total_clase", "total_sobrevivieron"]

                primera   segunda   tercera  total_sobrevivieron
murieron       0.089787  0.108866  0.417508             0.616162
sobrevivieron  0.152637  0.097643  0.133558             0.383838
total_clase    0.242424  0.206510  0.551066             1.000000

# Frecuencias relativas marginales por filas

In [62]:
# axis = 0 -> por filas 
# Se calcula respecto al total de cada fila
survived_pclass.div(survived_pclass["total_sobrevivieron"], axis = 0)

                primera   segunda   tercera  total_sobrevivieron
murieron       0.145719  0.176685  0.677596                  1.0
sobrevivieron  0.397661  0.254386  0.347953                  1.0
total_clase    0.242424  0.206510  0.551066                  1.0

# Frecuencias relativas marginales, por columnas

In [66]:
# axis = 1 por columnas ; poner ".loc" para buscar para buscar filas
survived_pclass.div(survived_pclass.loc["total_clase"], axis = 1) # Utilimos .LOC para acceder por columans

               primera   segunda   tercera  total_sobrevivieron
murieron       0.37037  0.527174  0.757637             0.616162
sobrevivieron  0.62963  0.472826  0.242363             0.383838
total_clase    1.00000  1.000000  1.000000             1.000000

# Tablas de 2 dimensiones

In [70]:
surv_sex_pclass = pd.crosstab(index = titanic["survived"],
                              columns = [titanic["sex"], titanic["pclass"]],
                              margins = True)
surv_sex_pclass

sex      female          male            All
pclass        1   2    3    1    2    3
survived
0             3   6   72   77   91  300  549
1            91  70   72   45   17   47  342
All          94  76  144  122  108  347  891

# Ejercicio 3 : Tablas de más de 2 variables
Hacer las tablas de frecuencuias relativas marginales por filas y por columnas partiendo da la tabla "surv_sex_pclass"

In [87]:
# Solución por filas
# Porcentajes respecto al total de cada fila
surv_sex_pclass.div(surv_sex_pclass["All"], axis = 0)

sex         female                          male                      All
pclass           1         2         3         1         2         3
survived
0         0.005464  0.010929  0.131148  0.140255  0.165756  0.546448  1.0
1         0.266082  0.204678  0.210526  0.131579  0.049708  0.137427  1.0
All       0.105499  0.085297  0.161616  0.136925  0.121212  0.389450  1.0

In [86]:
surv_sex_pclass.div(surv_sex_pclass.loc["All"], axis = 1) # Utilimos .LOC para acceder por columans

sex         female                     male                           All
pclass           1         2    3         1         2         3
survived
0         0.031915  0.078947  0.5  0.631148  0.842593  0.864553  0.616162
1         0.968085  0.921053  0.5  0.368852  0.157407  0.135447  0.383838
All       1.000000  1.000000  1.0  1.000000  1.000000  1.000000  1.000000

# DATOS ORDINALES

Además ................... prodremos calcular adedmas las ......

# DATOS CUANTATIVOS

### DATOS CONTINUOS
El peso, altura 
### DATOS DISCRETOS
personas de un pueblo, etc. (sin decimales)

### 3 tipos de medidas
#### Media aritmetica (valor medio)
#### Mediana: Valor central de una lista ordenada
#### Moda: Valor con máxima frecuencia